# taps
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

# formulae
brew "bash"
brew "bash-completion@2"
brew "bat" # cat alt
brew "cmake"
brew "coreutils"
brew "curl"
brew "exa" # ls alt
brew "fd"
brew "findutils"
brew "fontconfig"
brew "gh"
brew "git"
brew "gnu-tar"
brew "gnupg"
brew "grep"
brew "htop"
brew "llvm"
brew "make"
brew "mas"
brew "neovim"
brew "node"
brew "openjdk"
brew "python@3"
brew "ripgrep"
brew "stow"
brew "tmux"
brew "tree"
brew "vifm"
brew "vim"
brew "youtube-dl"
#brew "zig"
brew "zsh"
brew "zsh-completions"

# casks
cask "appcleaner"
cask "balenaetcher"
cask "boop"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka"
cask "font-iosevka-aile"
cask "font-iosevka-nerd-font"
cask "font-iosevka-ss04"
#cask "freeplane"
#cask "iptvnator"
cask "iterm2"
#cask "kodi"
cask "opera"
cask "rar"
#cask "retroarch"
cask "stremio"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

# mac apps
mas "Bitdefender Virus Scanner", id: 500154009
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
